package main

import "net/http" 
// пакет для реалізації веб сервера, який дає клієнтську і серверну реалзіацію протоколу http

func main() {
// функція вмикає сервер, який слухає мережевий порт 8080 і реалізує функціонал файлового сервера для статичного контенту 
// простою мовою, всі запити на цей порт будуть адресовані на файл у певній директорії

	http.ListenAndServe(":8080",http.FileServer(http.Dir("./html")))
}

// бідл сервера за допомогою команди "go build -o bin/app src/main.go"
// команда говорить компілятору Go взяти вихідний код із файлу src/main.go
// скомпілювати його та зберегти виконуваний файл з ім'ям app у папці bin.